/* 
  Localizable.strings (English)
  AMD Power Gadget
*/

/* NOTE: Some keys use Spanish text for historical reasons. */
/* These are used as lookup identifiers and work correctly. */
/* A future refactor should standardize all keys to English. */

"Dashboard" = "لوحة التحكم";
"Telemetry" = "التليمتري";
"Fan Control" = "تحكم المعجبين";
"Profiles" = "Profiles";
"Advanced" = "متقدم";
"Menu Bar" = "شريط القائمة";
"System Info" = "معلومات النظام";
"Desktop Widgets" = "أدوات سطح المكتب";

"AMD Power" = "قوة AMD";
"Gadget" = "Gadget";

"CPU" = "المعالج";
"GPU" = "GPU";
"Freq" = "فرق";
"Average" = "متوسط";
"Avg: %@" = "متوسط: %@";
"Collecting data…" = "جاري جمع البيانات…";

"Low Power Mode (LPM)" = "وضع الطاقة المنخفضة (LPM)";
"Allows macOS to auto-manage CPU frequency" = "السماح لـ macOS بإدارة تردد المعالج تلقائياً";
"Forces CPU to lowest frequency for minimum power" = "القوات المعالج إلى أدنى تردد للحد الأدنى من الطاقة";
"Core Performance Boost (CPB)" = "تعزيز الأداء الأساسي (CPB)";
"Update Interval" = "الفاصل الزمني للتحديث";
"Adjust how frequently telemetry data updates. Lower = more responsive, higher = less CPU usage." = "ضبط عدد مرات تحديثات بيانات القياس عن بعد. أقل = أكثر استجابة، أعلى = أقل استخدام المعالج.";

"Opciones en Menú Bar" = "خيارات شريط القائمة";
"Choose which items appear in the menu bar. Changes apply immediately." = "اختر العناصر التي تظهر في شريط القائمة. التغييرات تطبق فورا.";
"Customize the visual appearance of the menu bar items." = "تخصيص المظهر المرئي لعناصر شريط القائمة.";
"Límite de Temp de Alerta" = "حد مؤقت للتنبيه";
"Color de Alerta de Temp" = "لون مؤقت التنبيه";
"Color de Flechas" = "لون الأسهم";
"Additional telemetry for the menu bar." = "قياسات إضافية عن بعد لشريط القائمة.";
"GPU data is shown inside Temp, Power, Memory and Fan columns when enabled." = "يتم عرض بيانات GPU داخل أعمدة Temp, Power و الذاكرة و المعجبين عند التمكين.";
"Show GPU VRAM" = "إظهار GPU VRAM";
"G:X.XG in Memory column" = "G:X.XG في عمود الذاكرة";
"Show GPU Fan Speed" = "إظهار سرعة معجب GPU";
"G:XXXX in Fan column" = "G:XXXX في عمود المعجب";

"No fans detected." = "لم يتم اكتشاف أي معجب.";
"SMC driver not available" = "مشغل SMC غير متوفر";
"Your SMC chip may not be supported." = "قد لا تكون شريحة SMC الخاصة بك مدعومة.";
"RPM" = "RPM";
"Throttle" = "خنق";
"↩ Reset to Auto" = "↩️ إعادة تعيين تلقائي";

"Select a profile to adjust the CPU operating range. Changes take effect immediately." = "حدد ملفًا شخصيًا لضبط نطاق تشغيل المعالج. تصبح التغييرات سارية المفعول فوراً.";

"Directly edit raw P-State registers. Requires kext privilege check disabled via boot-arg or root." = "تحرير سجلات P-الدولة الخام مباشرة. يتطلب التحقق من امتياز النص معطل عن طريق boot-arg أو الجذر.";
"This will write the raw P-State definitions directly to the CPU. Proceed?" = "سيؤدي هذا إلى كتابة تعاريف P-State الخام مباشرة إلى وحدة المعالجة المركزية. هل تريد المتابعة؟";
"Disabled — work in progress" = "معوق - العمل الجاري";
"WIP" = "وايبي";

"Enable in OC: Misc → Security → ExposeSensitiveData = 0x08" = "تمكين في OC: Misc → Security → ExposeSensitiveData = 0x08";
"Motherboard info not available" = "معلومات اللوحة الأم غير متوفرة";

"Vista previa de la Barra de Menús:" = "استعراض شريط القائمة:";
"Ancho estimado: %dpt" = "العرض التقديري: %dpt";
"Restart the app to fully apply width changes." = "أعد تشغيل التطبيق لتطبيق تغييرات العرض بالكامل.";
"Small (%dpt)" = "صغير (%dpt)";
"Medium (%dpt)" = "متوسط (%dpt)";
"Large (%dpt)" = "كبير (%dpt)";

"Green" = "أخضر";
"Blue" = "أزرق";
"Orange" = "برتقالي";
"Red" = "أحمر";
"Purple" = "بنفسجي";
"Pink" = "وردي";
"Teal" = "الفم";
"Turquoise" = "Turquoise";

"Verde" = "أخضر";
"Azul" = "أزرق";
"Naranja" = "برتقالي";
"Rojo" = "أحمر";
"Morado" = "بنفسجي";
"Rosa" = "وردي";
"Turquesa" = "الفم";

"Dynamic Colors (Temp Only)" = "الألوان الديناميكية (القصة فقط)";
"Temp Alert Color" = "لون التنبيه المؤقت";
"Temp Alert Limit" = "حد التنبيه المؤقت";
"Network" = "الشبكة";
"Network Arrows Color" = "لون أسهم الشبكة";
"Exit" = "الخروج";
"AMD Power Gadget" = "أداة طاقة AMD";
"AMD Power Tool" = "أداة طاقة AMD";
"SMC Fans" = "معجبين SMC";

"Fan 1" = "مروحة 1";
"Fan 2" = "مروحة 2";
"Fan 3" = "مروحة 3";
"Fan 4" = "مروحة 4";
"Fan 5" = "مروحة 5";
"Fan 6" = "مروحة 6";
"Fan 7" = "مروحة 7";
"Fan 8" = "مروحة 8";

/* Alerts */
"To enable motherboard display:" = "لتمكين عرض اللوحات الأم:";
"Open your OpenCore config file,\n\nGo to Misc -> Security -> ExposeSensitiveData,\n\nSet the value to 0x08 to expose board information." = "افتح ملف تكوين OpenCore الخاص بك،\n\nانتقل إلى --> Security -> ExposeSensitiveData,\n\nعيّن القيمة إلى 0x08 لعرض معلومات اللوحة.";
"Done" = "تم";
"Invalid Input" = "Invalid Input";
"Please type in numbers in hexadecimal." = "الرجاء كتابة الأرقام في سداسي الكمال.";
"Unable to Set PStateDef" = "غير قادر على تعيين PStateDef";
"Action was denied as current user does not have enough privilege,\nor was canceled by current user.\n\nRun AMD Power Gadget as root user or disable privilege check with boot-arg '-amdpnopchk'\n\nOtherwise, click 'Once' in the warning message to allow this change." = "تم رفض الإجراء لأن المستخدم الحالي ليس لديه ما يكفي من الامتيازات،\nأو تم إلغاؤه من قبل المستخدم الحالي.\n\nتشغيل أداة AMD للطاقة كمستخدم للجذر أو تعطيل التحقق من الامتيازات مع boot-arg '-amdpnopchk'\n\nخلاف ذلك، انقر فوق 'لمرة واحدة' في رسالة التحذير للسماح بهذا التغيير.";
"Your changes will not be saved" = "لن يتم حفظ التغييرات الخاصة بك";
"Click apply to save changes before closing this windows." = "انقر فوق تطبيق لحفظ التغييرات قبل إغلاق هذه النوافذ.";
"Cancel" = "إلغاء";
"Close without saving" = "إغلاق بدون حفظ";
"Invalid File" = "ملف غير صالح";
"The selected file could not be read or is not a valid pstate file." = "الملف المحدد لا يمكن قراءته أو أنه ملف pstate غير صالح.";
"OK" = "حسناً";

/* Dynamic format strings */
"Avg: %.2f GHz, Max: %.2f GHz" = "متوفر: %.2f Gz، الحد الأقصى: %.2f Gz";
"%.2f °C" = "%.2f °C";
"%.2f Watt" = "%.2f W";

/* Session Peaks */
"Session Peaks" = "ذروة الجلسة";
"Reset Peaks" = "إعادة تعيين القمم";

/* GPU Fan Control */
"GPU Fan Control (Zero RPM / Curves)" = "تحكم معجبات GPU (صفر RPM / منحنيات)";
"macOS Hardware Limitation" = "الحد من أجهزة macOS";
"Direct software-based GPU fan speed overrides (such as zero-rpm toggle or drawing fan curves in macOS) are not supported by the macOS kernel/IOKit driver for AMD GPUs. The GPU's onboard firmware (vBIOS) manages the fans." = "أما التجاوزات السريعة لمعجّبات \"GPU\" القائمة على البرامجيات المباشرة (مثل تبديل \"صفر-ربكم\" أو منحنيات رسم المعجّبات في \"macOS\")، فلا يدعمها سائق \"kacOS\" الخاص بوحدات التحكم العالمية AMD GPUs. ويدير البرنامج الثابت للاتحاد العالمي للاتصالات على متنه (vBIOS) المشجعين.";
"Standard Hackintosh Solution:" = "حل هاكينتوش القياسي:";
"The only way to modify this behavior (like forcing fans to spin at lower temperatures or disabling Zero RPM) is by exporting the vBIOS, creating a Soft PowerPlay Table (SPPT), and injecting it via OpenCore's config.plist under DeviceProperties." = "الطريقة الوحيدة لتعديل هذا السلوك (مثل إرغام المعجبين على الدوران في درجات حرارة منخفضة أو تعطيل زيرو RPM) هي بتصدير vBIOS، إنشاء جدول تشغيل PowerPlay ناعم (SPPT)، وحقنه عن طريق تكوين OpenCoer. قائمة تحت خصائص الأجهزة.";
"Open SPPT Guide" = "فتح دليل SPPT";
"MorePowerTool" = "مورباورتول";

/* CPPC & EPP */
"Native CPPC Active Mode (EPP)" = "الوضع النشط الأصلي لـ CPPC (EPP)";
"Enables autonomous hardware frequency scaling (recommended)" = "تمكين قياس تردد الأجهزة الذاتية (مستحسن)";
"Power Management Mode" = "وضع إدارة الطاقة";
"Energy Preference (EPP)" = "تفضيل الطاقة (EPP)";
"Select a hardware autonomous profile. The CPU will scale frequency dynamically." = "حدد ملفًا شخصيًا ذاتيًا للجهاز. سيقيّم المعالج التردد بشكل ديناميكي.";
"Performance" = "الأداء";
"Balanced Perf" = "عرض متوازن";
"Balanced Power" = "قوة متوازنة";
"Power Save" = "حفظ الطاقة";
"Active Profile Status" = "حالة الملف الشخصي النشط";
"CPU Speed Profiles (Legacy)" = "ملفات سرعة المعالج (إرث)";
"Select a manual P-State override profile. Frequencies will be restricted to the selected step." = "حدد ملفّ شخصي يدوي لتجاوز الدولة. الترددات ستقتصر على الخطوة المحددة.";
"Mode" = "الوضع";
"EPP Profile" = "ملف EPP";

/* Desktop Widgets */
"Show CPU Widget" = "إظهار أداة المعالج";
"Show GPU Widget" = "إظهار أداة GPU";
"Show RAM Widget" = "Show RAM Widget";
"Show Disk Widget" = "إظهار شريط القرص";
"Show Network Widget" = "إظهار أداة الشبكة";
"Show Fan Widget" = "إظهار أداة المعجبين";
"Disable All Widgets" = "تعطيل جميع الأدوات";
"Sort by Rank" = "الترتيب حسب الرتبة";
"Edit Widget Layout" = "تعديل تخطيط القطعة";
"Unlock widgets to drag them around the screen" = "فتح التطبيقات المصغرة لسحبها حول الشاشة";
"Widget Options" = "خيارات الودجت";
"Customize the appearance and behavior of your desktop widgets." = "تخصيص مظهر وسلوك أدوات سطح المكتب الخاص بك.";
"Auto-Align Active Widgets" = "محاذاة الأدوات النشطة تلقائياً";
"Automatically stack active widgets at a corner" = "تكديس الأدوات النشطة تلقائياً في زاوية";
"Alignment Corner" = "زاوية المواءمة";
"Top Right" = "أعلى اليمين";
"Top Left" = "أعلى اليسار";
"Bottom Right" = "أسفل اليمين";
"Bottom Left" = "أسفل اليسار";
"Show Clock Widget" = "إظهار أداة الساعة";
"Clock" = "الساعة";
"Stats Table" = "جدول الإحصائيات";
"Classic Glass" = "زجاج كلاسيكي";
"Pro Monitor" = "Pro Monitor";
"Core Matrix" = "مصفوفة أساسية";

"United" = "متحدة";
"Show United Widget" = "إظهار القطعة المتحدة";
"Configure Combined Metrics" = "تكوين القياسات المجمعة";
"Include CPU" = "تضمين المعالج";
"Include GPU" = "تضمين GPU";
"Include RAM" = "تضمين ذاكرة الوصول العشوائي";
"Include Disk" = "تضمين القرص";
"Include Network" = "تضمين الشبكة";
"Include Fan" = "تضمين المعجبين";

"Temas & Apariencia" = "السمات و المظهر";
"Análisis" = "تحليل";

"Select Visual Theme (Instant Application)" = "حدد سمة مرئية (تطبيق فوري)";
"Custom Theme Creator & Exchange (JSON)" = "إنشاء وتبادل السمات المخصصة (JSON)";
"Chart Rendering Style" = "نمط تقديم الرسم البياني";
"Custom Theme Editor" = "محرر السمة المخصص";
"Showing active theme colors. Adjust any color to customize." = "عرض ألوان السمة النشطة. ضبط أي لون لتخصيصه.";
"Use the Opacity slider for transparency (macOS color panel alone often resets alpha)." = "استخدم شريط تمرير التعتيم للشفافية (لوحة الألوان (لوحة الألوان لوحدها) غالباً ما تعيد تعيين ألفا).";
"Opacity" = "التعتيم";
"Edit Active Theme" = "تحرير السمة النشطة";
"Export Theme (JSON)" = "تصدير السمة (JSON)";
"Import Theme (JSON)" = "استيراد السمة (JSON)";
"Card Background" = "خلفية البطاقة";
"Cyan Accent" = "لوكنة سماوية";
"Orange Accent" = "اللكنة البرتقالية";
"Green Accent" = "اللكنة الخضراء";
"Purple Accent" = "اللكنة الأرجوانية";

/* ===== Auto-extracted / curated for Crowdin (v3.16.1+) ===== */
"%.0f" = "%.0f";
"%.0f K/s" = "%.0f K/s";
"%.0f MHz" = "%.0f MHz";
"%.0f%%" = "%.0f%%";
"%.0fG" = "%.0fG";
"%.0f°" = "%.0f°";
"%.0f°C" = "%.0f°C";
"%.0f°C • %.0fW" = "%.0f°C • %.0fW";
"%.1f %@" = "%.1f %@";
"%.1f Ghz" = "%.1f Ghz";
"%.1f M/s" = "%.1f M/s";
"%.1f s" = "%.1f ثانية";
"%.1f%%" = "%.1f%%";
"%.1f°C" = "%.1f°C";
"%.2f GHz" = "%.2f Gz";
"%.3f V" = "%.3f V";
"%.4f V" = "%.4f V";
"100°C" = "100°س";
"1h" = "1 ساعة";
"24h" = "24ساعة";
"30d" = "30د";
"60°C" = "60 درجة س";
"7d" = "7d";
"Accept & Continue" = "قبول ومتابعة";
"Active" = "نشط";
"All Auto" = "الكل تلقائي";
"All Combined" = "الكل مجمعة";
"All Fans Auto" = "جميع المعجبين تلقائياً";
"AMD CPU Cores" = "نواة المعالج AMD";
"AMD Power Gadget recolecta datos automáticamente cada minuto." = "AMD أدوات الطاقة يستعيد البيانات تلقائيا<unk> ticamente cada دقيقة.";
"AMD Processor Power Manager (PPM)" = "مدير طاقة المعالج AMD (PPM)";
"Analysis" = "تحليل";
"Apply" = "تطبيق";
"Apply P-States?" = "هل تريد تطبيق P-State؟";
"Arrange the order in which resource widgets appear. Click arrows to swap position." = "ترتيب ترتيب الويدج للموارد. انقر على الأسهم لمبادلة الموقع.";
"Arrow Color" = "لون السهم";
"Automatically switches EPP profiles based on live CPU load" = "التبديل التلقائي لملفات EPP استنادًا إلى تحميل المعالج المباشر";
"Average core frequency in GHz" = "متوسط التردد الأساسي في غيغاهرتز";
"Average utilization over time" = "متوسط الاستخدام بمرور الوقت";
"Avg Frequency" = "متوسط التردد";
"Avg." = "متوسط";
"Avg: %.0f%%" = "متوفر: %.0f%%";
"Balanced\n%.1f GHz" = "متوازن\n%.1f Gz";
"Base\n%.1f GHz" = "القاعدة\n%.1f Gz";
"BIOS / Auto" = "BIOS / تلقائي";
"Buscando actualizaciones..." = "Buscando actualizaciones...";
"Bytes (Read)" = "بايت (مقروء)";
"Bytes (Write)" = "بايت (كتابة)";
"Cargando tendencias de telemetría..." = "Cargando tendencias de telemetría...";
"Chart Metric" = "الرسم البياني";
"Chart Type" = "نوع المخطط";
"Charts require macOS 13+" = "الرسوم البيانية تتطلب macOS 13+";
"Charts require macOS 13.0+" = "تتطلب الرسوم البيانية macOS 13.0+";
"Check for new releases of SMCAMDProcessor and AMD Power Gadget on GitHub." = "تحقق من الإصدارات الجديدة لـ SMCAMDProالمعالج و أداة AMD للطاقة على GitHub.";
"Check for Updates" = "التحقق من وجود تحديثات";
"Check Now" = "تحقق الآن";
"Circular Ring" = "خاتم دائري";
"Column Bars" = "شريط الأعمدة";
"Configure Charts" = "تكوين الرسوم البيانية";
"Configure labels and layout details for widgets inside the popover." = "تكوين التسميات وتفاصيل التخطيط للواجهة المصغرة داخل النوافذ.";
"Connection Error: %@" = "خطأ في الاتصال: %@";
"Continuous Background Logging" = "تسجيل مستمر في الخلفية";
"Continuously write telemetry samples to a CSV file in the background" = "كتابة عينات القياس عن بعد باستمرار إلى ملف CSV في الخلفية";
"Control Mode" = "وضع التحكم";
"Core Rankings (Estimated by Freq)" = "تصنيف النواة (مقدّر من Freq)";
"Could not fetch release info." = "تعذر جلب معلومات الإصدار.";
"CPPC hardware rankings are active and loaded from the processor." = "تصنيفات أجهزة CPPC نشطة وتحميلها من المعالجة.";
"CPPC hardware values could not be read. Rankings are estimated from the maximum observed clock frequency of each core." = "لا يمكن قراءة قيم أجهزة CPPC . يتم تقدير التصنيفات من الحد الأقصى لتكرار الساعة الملاحظة لكل نواة .";
"CPPC Preferred Cores (Silicon Quality)" = "النواة المفضلة لـ CPPC (جودة سيليكون)";
"CPPC: Active" = "CPPC: نشط";
"CPPC: Estimated" = "CPPC: مقدّر";
"CPU and GPU temperatures" = "درجة حرارة المعالج و المعالج العالمي";
"CPU Average Frequency" = "تردد متوسط المعالج";
"CPU Freq Avg (GHz)" = "متوسط فرق المعالج (GHz)";
"CPU Frequency" = "تردد المعالج";
"CPU Load" = "تحميل المعالج";
"CPU Load (%)" = "حمولة المعالج (%)";
"CPU Package Power" = "قوة حزمة المعالج";
"CPU Per-Core Thread Load" = "معالج معالج محمل الموضوع الأساسي";
"CPU Power" = "قوة المعالج";
"CPU Power (W)" = "قوة المعالج (W)";
"CPU Power Alert" = "تنبيه الطاقة المعالج";
"CPU power has been at %.1fW (above limit of %dW) for over %d seconds!" = "قوة المعالج في %.1fW (فوق الحد الأقصى %dW) لأكثر من %d ثوان!";
"CPU Temp" = "قالب المعالج";
"CPU Temp (°C)" = "قوالب المعالج (درجة مئوية)";
"CPU Temperature" = "درجة حرارة المعالج";
"CPU Temperature Alert" = "تنبيه درجة حرارة المعالج";
"CPU temperature has reached %.1f°C!" = "وصلت درجة حرارة المعالج %.1f°C!";
"CPU Tracker" = "تعقب المعالج";
"Current version: v%@\nNew version: %@\n\nRelease Notes:\n%@" = "الإصدار الحالي: v%@\nإصدار جديد: %@\n\nملاحظات الإصدار:\n%@";
"Curve" = "منحنى";
"Curve Optimizer is only active when the AMDRyzenCPUPowerManagement kext supports Zen 3 SMU mailbox interface." = "تحسين المنحنى نشط فقط عندما يكون نص AMDRyzenCPUPowerManagement يدعم واجهة صندوق البريد Zen 3 SMU";
"Custom" = "مخصص";
"Customize the behavior and visibility of the menu bar popover." = "تخصيص السلوك و رؤية شريط القوائم المنبثقة";
"Cyberpunk Neon" = "Cyberpunk Neon";
"Delete Point" = "حذف نقطة";
"Device Utilization %" = "استخدام الجهاز %";
"Disable heavy visual effects if your system lacks Metal graphics acceleration." = "تعطيل التأثيرات البصرية الثقيلة إذا كان نظامك يفتقر إلى تسارع الرسوم البيانية المعدنية.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user." = "DISCLAIMER: تتفاعل هذه البرمجيات مباشرة مع سجلات التحكم بالمعدات المنخفضة المستوى. باستخدامه، فإنك توافق على أن المسؤولية المطلقة عن أي عدم استقرار في النظام، أو تلف في المعدات، أو غزو أجنبي تقع بالكامل على عاتق المستخدم.";
"DISCLAIMER: This software interacts directly with low-level hardware control registers. By using it, you agree that absolute responsibility rests entirely with the user." = "ديسكلايمر: هذا البرنامج يتفاعل مباشرة مع سجلات التحكم بالمعدات ذات المستوى المنخفض. باستخدامه، فإنك توافق على أن المسؤولية المطلقة تقع بالكامل على عاتق المستخدم.";
"Disk" = "قرص";
"DISK" = "حذف";
"Disk Activity" = "نشاط القرص";
"Disk Activity (MB/s)" = "نشاط القرص (MB/s)";
"Disk Activity (Read+Write)" = "نشاط القرص (قراءة +كتابة)";
"Disk I/O" = "قرص I/O";
"Disk Tracker" = "تعقب القرص";
"Do you want AMD Power Gadget to start in menu bar at login? \n\n This will only be asked once. You can change this setting later under Appearance menu." = "هل تريد أداة توليد الطاقة AMD أن تبدأ في شريط القائمة عند تسجيل الدخول؟ \n\n سيتم سؤال هذا مرة واحدة فقط. يمكنك تغيير هذا الإعداد لاحقاً تحت قائمة الظهر.format@@0";
"Donate (PayPal)" = "تبرع (بايبال)";
"Download" = "تنزيل";
"Download on GitHub" = "تحميل على GitHub";
"Download Update" = "تنزيل التحديث";
"Drag control points to edit curve. Double-click empty space to add (max 8). Double-click a point or right-click to delete." = "اسحب نقاط التحكم لتعديل المنحنى. انقر نقراً مزدوجاً على مساحة فارغة لإضافتها (الحد الأقصى 8). انقر نقراً مزدوجاً على نقطة أو انقر بزر الماوس الأيمن لحذفها.";
"Dynamic Auto-EPP Workload Engine" = "محرك حمولة العمل التلقائي";
"Dynamic Next-Gen Fan Curves" = "منحنيات المعجبين الديناميكية التالية";
"Edit Layout" = "تعديل التخطيط";
"Efficient\n%.1f GHz" = "كفاءة\n%.1f Gz";
"Enable additional stats columns inside the popover." = "تمكين احصائيات اضافية أعمدة داخل النوافذ.";
"Enable System Alerts" = "تمكين تنبيهات النظام";
"Error reading CPU data." = "خطأ في قراءة بيانات المعالج.";
"Evaluated in the kernel with 256-step LUT interpolation, hysteresis, and smooth ramping." = "تم تقييمها في النواة مع 256-خطوة من التقاط LUT ، والضغط الضوئي ، والزحف السلس.";
"Export" = "تصدير";
"Export CSV" = "تصدير CSV";
"Export Telemetry History" = "تصدير سجل التليمتري";
"Export the history of samples currently in memory to a CSV file" = "تصدير سجل العينات الموجودة حاليا في الذاكرة إلى ملف CSV";
"Failed — check kext privileges (-amdpnopchk)." = "فشل — تحقق من امتيازات النص (-amdpnopchk).";
"Fan" = "المعجبين";
"Fan Number" = "رقم المعجبين";
"Fan Speed" = "سرعة المعجبين";
"Fan Speed (RPM)" = "سرعة المعجبين (RPM)";
"Fan Speed(RPM)" = "سرعة المعجبين";
"Filled Area" = "منطقة مملوءة";
"Freq:" = "تجميد:";
"Frequency" = "التردد";
"Frequency Max:" = "الحد الأقصى للتردد:";
"GHz" = "غيغاهرتز";
"GitHub Repository" = "GitHub Repository";
"GitHub Repository\n\nSpecial thanks to the AMD OS X community!\n\nCopyright © 2020-2026 Droga. All rights reserved." = "مستودع GitHub\n\nشكرًا خاصًا لمجتمع AMD OS X!\n\nحقوق الطبع والنشر ©️ 2020-2026 Droga. جميع الحقوق محفوظة.";
"GPU Load" = "تحميل GPU";
"GPU Model" = "نموذج GPU";
"GPU Power" = "طاقة GPU";
"GPU Power (W)" = "طاقة GPU (W)";
"GPU Temp" = "نموذج GPU";
"GPU Temp (°C)" = "نموذج GPU (درجة مئوية)";
"GPU Temperature" = "درجة حرارة GPU";
"GPU Tracker" = "تعقب GPU";
"H.264 & HEVC Active" = "H.264 & HEVC نشط";
"H.264 Active (HEVC Inactive)" = "H.264 نشط (HEVC غير نشط)";
"HEVC Active (H.264 Inactive)" = "نشط HEVC (H.264 غير نشط)";
"Hide this fan" = "إخفاء هذه المعجبة";
"High Load Threshold (Performance)" = "عتبة عالية التحميل (الأداء)";
"Histograma de Barras" = "هيستوغرام دي بارا";
"Hysteresis" = "Hysteresis";
"I accept that absolute responsibility lies entirely with the user." = "وأقبل أن المسؤولية المطلقة تقع بالكامل على عاتق المستخدم.";
"Idle Threshold (Power Save)" = "حد الخمول (توفير الطاقة)";
"Import" = "استيراد";
"Inactive" = "غير نشط";
"Inactive / Not Supported" = "غير نشط / غير مدعوم";
"Index" = "الفهرس";
"Inject positive or negative voltage offsets per core. Center is 0 (no override). Limit: -30 (undervolt) to +30 (overvolt) counts." = "حقن مكافآت فولتية إيجابية أو سالبة في النواة الواحدة. المركز هو 0 (لا تجاوز). الحد: -30 (تحت فولط) إلى +30 (فوق فوليت).";
"Inst(s) Retired:" = "تثبيت (متقاعد):";
"Kext Update Available" = "تحديث النص متوفر";
"Later" = "لاحقاً";
"Line Only" = "الخط فقط";
"Load" = "تحميل";
"Loading..." = "تحميل...";
"Log File Location" = "موقع ملف السجل";
"Logical Cores" = "النواة المنطقية";
"Low Performance Mode" = "وضع الأداء المنخفض";
"Low Power\n%.1f GHz" = "قوة منخفضة\n%.1f Gz";
"Línea Escalonada (Step)" = "لينا اسكالونادا (Step)";
"Línea Suave (Spline)" = "ليسنيا سواف (الشفرة)";
"Manual Override" = "تجاوز يدوي";
"Max Speed" = "الحد الأقصى للسرعة";
"Max." = "اقصى.";
"MB/s" = "ميغابايت/ث";
"Memory Usage" = "استخدام الذاكرة";
"Menu Bar Preview:" = "استعراض شريط القائمة:";
"Mi Tema Custom" = "Mi Tema مخصص";
"Min." = "دقيقة";
"Monochrome Stealth" = "ثروة أحادية الكروم";
"Máx." = "مايكس.";
"Máx:" = "مايكس:";
"Mín." = "ميشن.";
"Mín:" = "ميسين:";
"N/A" = "لا";
"Net" = "الصافي";
"Net Download (MB/s)" = "التحميل الصافي (MB/s)";
"Net Upload (MB/s)" = "صافي التحميل (MB/s)";
"Network Speed" = "سرعة الشبكة";
"Network Throughput" = "الشبكة طوال";
"Network Total Speed" = "سرعة الشبكة الإجمالية";
"New version %@ available!" = "نسخة جديدة %@ متوفرة!";
"New Version Available: %@" = "نسخة جديدة متوفرة: %@";
"No" = "لا";
"No AMDRyzenCPUPowerManagement Found!" = "لم يتم العثور على AMDRyzenCPUPowerManagement";
"No curves configured." = "لم يتم تكوين منحنيات.";
"No hay suficientes datos recolectados aún." = "No hay suficientes datos recolectados aún.";
"No location selected" = "لم يتم تحديد أي موقع";
"No metrics active" = "لا توجد مقاييس نشطة";
"No release notes available." = "لا توجد ملاحظات الإصدار المتاحة.";
"Nordic Frost" = "فروست نوردي";
"Not Supported" = "غير مدعوم";
"Not supported by your CPU" = "غير مدعوم من قبل المعالج الخاص بك";
"Not yet" = "ليس بعد";
"Open Dashboard" = "فتح لوحة التحكم";
"Other Popover Widgets" = "ويدجات أخرى";
"P-State Editor" = "محرر الدولة ف-5";
"P-States applied successfully." = "وقد طبقت الدول المصدرة للوثائق بنجاح.";
"P-States Configuration" = "تكوين P-States";
"Package" = "حزمة";
"Package Power" = "قوة الحزمة";
"Peak Fan" = "ذروة المعجبين";
"Peak Freq" = "ذروة الفرق";
"Peak Power" = "قوة الذروة";
"Peak Temp" = "الذروة المؤقتة";
"Performance\n%.1f GHz" = "الأداء\n%.1f Gz";
"Performance & Fallback" = "الأداء والخروج";
"Personalizado" = "Personalizado";
"Physical Cores" = "النواة المادية";
"Pin Popover Open" = "فتح Pin Popover";
"Platform" = "المنصة";
"Please download AMDRyzenCPUPowerManagement from the release page." = "الرجاء تحميل AMDRyzenCPUPowerManagement من صفحة الإصدار.";
"Popover Config" = "Popover Config";
"Popover General Settings" = "الإعدادات العامة النافذة";
"Popover Menu" = "Popover Menu";
"Power" = "القوة";
"Power Warning Threshold (PPT)" = "حد تحذير الطاقة (PPT)";
"Prevent the popover from closing when clicking outside" = "منع إغلاق النوافذ المنبثقة عند النقر على الخارج";
"Preview" = "معاينة";
"Processor" = "المعالج";
"Profile" = "الملف الشخصي";
"Progress Bar" = "شريط التقدم";
"Prom." = "بروم";
"PWR" = "PWR";
"Quick Fan Access" = "وصول المعجبين السريع";
"Quit" = "الخروج";
"Quit and Download" = "الخروج والتنزيل";
"Radeon GPU" = "Radeon GPU";
"Radeon Graphics utilization percentage" = "نسبة استخدام الرسم البياني";
"RAM" = "RAM";
"RAM Tracker" = "تعقب ذاكرة الوصول العشوائي";
"RAM Usage" = "RAM Usage";
"RAM Usage (%)" = "RAM Usage (%)";
"RAM Utilization" = "RAM Utilization";
"RAM utilization percentage" = "نسبة استخدام ذاكرة الوصول العشوائي";
"Ramp Rate" = "معدل القطع";
"Raw Register Details" = "تفاصيل السجل الخام";
"Read Speed" = "سرعة القراءة";
"Real-time energy consumption in Watts" = "استهلاك الطاقة في الوقت الحقيقي في واط";
"Real-time History" = "تاريخ الوقت الحقيقي";
"Real-time upload / download speed (↑/↓)" = "سرعة التحميل / التحميل في الوقت الحقيقي (<unk> /<unk> )";
"Receive native macOS alerts when the CPU exceeds configured thermal or power limits." = "تلقي تنبيهات macOS الأصلية عندما تتجاوز وحدة المعالجة المركزية حدود الحرارة أو الطاقة المعدّة.";
"Refresh Rate" = "معدل التحديث";
"Relative Time (s)" = "الوقت النسبي (ات)";
"Replaces translucent blurs with solid colors to save CPU" = "يستبدل الضبابية الشفافة بالألوان الصلبة لحفظ المعالج";
"Requests permission and enables hardware limit warnings" = "يطلب الإذن ويمكّن الحد الأقصى من تحذيرات الأجهزة";
"Revert" = "العودة";
"Right-click any widget directly on your desktop to change its style dynamically (Classic Glass, Pro Monitor, or Core Matrix)." = "انقر بالزر الأيمن على أي عنصر واجهة مستخدم مباشرة على سطح المكتب الخاص بك لتغيير أسلوبه بشكل ديناميكي (زجاج كلاسيك، أو راقب برو أو مصفوفة أساسية).";
"SAFETY DISCLAIMER & LIABILITY AGREEMENT" = "الاتفاق الخاص بالتسجيل والبحث";
"Seleccioná una gráfica en el panel superior para visualizar su histórico." = "اختر لغة في اللوحة متفوقة أو مرئيةsu histo<unk> rico.";
"Select File..." = "حدد ملف...";
"Select which metrics are shown and choose their visualization style." = "حدد المقاييس التي يتم عرضها واختيار أسلوب رؤيتها.";
"Series" = "السلسلة";
"Show a floating, non-interactive widget on your desktop for live telemetry." = "إظهار أداة عائمة وغير تفاعلية على سطح المكتب الخاص بك للقياس المباشر عن بعد.";
"Show All (%d hidden)" = "إظهار الكل (%d مخفي)";
"Show CPU" = "إظهار المعالج";
"Show Fan RPM" = "إظهار معجبات RPM";
"Show GPU Power" = "إظهار طاقة GPU";
"Show GPU Row" = "إظهار صف GPU";
"Show GPU Temp" = "إظهار نموذج GPU";
"Show Memory" = "إظهار الذاكرة";
"Show Network" = "إظهار الشبكة";
"Show Network Row" = "إظهار صف الشبكة";
"Show Network Speed Sparkline Graph below" = "إظهار رسم بياني لسرعة الشبكة أدناه";
"Show Per-Core Utilization Grid below" = "إظهار شبكة الاستخدام لكل أساس أدناه";
"Show Power" = "إظهار القوة";
"Show Ring Details" = "إظهار تفاصيل الخاتم";
"Show Ring Labels" = "إظهار تسميات الخاتم";
"Show Temperature" = "إظهار درجة الحرارة";
"Show Temperature Sparkline Graph below" = "إظهار الرسم البياني خط الحرارة أدناه";
"Show Top Processes" = "إظهار العمليات العلوية";
"Single large value instead of max/avg stack" = "قيمة واحدة كبيرة بدلاً من الحد الأقصى/متوسط تكدس";
"SMC Fan Control" = "تحكم معجبات الرسائل القصيرة";
"Smooth Curves" = "انحرافات سلسة";
"Software" = "البرمجيات";
"Software Updates" = "تحديثات البرنامج";
"Solarized Amber" = "أمبر شمسي";
"Speed" = "السرعة";
"SSD" = "SSD";
"Startup at login?" = "بدء التشغيل عند تسجيل الدخول؟";
"Statistics" = "الإحصائيات";
"Storage" = "التخزين";
"Style" = "النمط";
"Style Options" = "خيارات النمط";
"Styles & Themes" = "Styles & Themes";
"Supported by your CPU" = "مدعوم من قبل المعالج الخاص بك";
"Sustained Duration" = "المدة المستدامة";
"Swap Total" = "تبديل المجموع";
"Swap Used" = "التبديل المستخدم";
"System Alert Notifications" = "تنبيه النظام";
"System Up to Date" = "النظام حتى تاريخه";
"Tahoe Glass" = "زجاج تاهو";
"Temp" = "حتمية";
"Temp Source" = "مصدر مؤقت";
"Temperature" = "درجة";
"Temperature Warning Threshold" = "حد تحذير درجة الحرارة";
"Temperature(C)" = "درجة الحرارة";
"Temperatures" = "درجات";
"Themes & Appearance" = "السمات و المظهر";
"Thermal History" = "تاريخ الحرارة";
"This application can not be launched due to AMDRyzenCPUPowerManagement is reporting incorrect data." = "لا يمكن تشغيل هذا التطبيق لأن AMDRyzenCPUPowerManagement يبلغ عن بيانات غير صحيحة.";
"This software interacts directly with low-level CPU hardware registers, Model-Specific Registers (MSRs), and the System Management Unit (SMU) to control CPU voltages, frequencies, and power limits.\n\nIncorrect settings, unstable undervolting, or wrong configurations can cause system instability, data loss, kernel panics, or permanent hardware damage.\n\nBy continuing, you agree that absolute responsibility for any system instability, hardware damage, or alien invasion lies entirely with the user. The authors and contributors assume no liability whatsoever for any damage, loss, or side effects to your hardware, software, or personal property. Use at your own risk." = "يتفاعل هذا البرنامج مباشرة مع سجلات معدات وحدة المعالجة المركزية ذات المستوى المنخفض، السجلات الخاصة بالنماذج، (MSRs). ووحدة إدارة النظام (SMU) للتحكم في فولتاين وحدة المعالجة المركزية والترددات وحدود الطاقة.\n\nالإعدادات غير الصحيحة، أو الإعدادات غير المستقرة، أو الخاطئة يمكن أن تسبب عدم استقرار النظام، أو فقدان البيانات، أو الذعر، أو تلف الأجهزة الدائمة.\n\nبالاستمرار، أنت توافق على أن المسؤولية المطلقة عن أي عدم استقرار في النظام، أو تلف في الأجهزة أو غزو أجنبي تقع بالكامل على عاتق المستخدم. لا يتحمل المؤلفون والمساهمون أي مسؤولية على الإطلاق عن أي ضرر أو خسارة أو آثار جانبية على جهازك أو برنامجك أو ممتلكاتك الشخصية. استخدم على مسؤوليتك الخاصة.";
"Thread %d: %.1f%%" = "الموضوع %d: %.1f%%";
"Time" = "الوقت";
"Timeframe" = "Timeframe";
"Timestamp" = "الطابع الزمني";
"TMP" = "TMP";
"Todas las gráficas están ocultas." = "Todas las gráficas están ocultas.";
"Top Processes" = "أعلى العمليات";
"Total" = "المجموع";
"Total Power(W)" = "إجمالي القوة (W)";
"Tracks active memory usage and pressure." = "تتبع استخدام الذاكرة النشطة والضغط عليها.";
"Tracks CPU utilization average and core temperature." = "تتبع متوسط استخدام وحدة المعالجة المركزية ودرجة الحرارة الأساسية.";
"Tracks graphics memory (VRAM) utilization." = "تتبع الذاكرة الرسومية باستخدام VRAM.";
"Tracks graphics utilization and temperature." = "يتتبع استخدام الرسوم البيانية ودرجة الحرارة.";
"Tracks primary storage capacity usage." = "تتبع استخدام سعة التخزين الأساسية.";
"Unknown" = "غير معروف";
"Unknown GPU" = "GPU غير معروف";
"Unlock Curve Optimizer (DANGEROUS: unstable undervolting can cause kernel panic or instant reboot)" = "فتح تحسين المنحنى (DANGEROUS: غير مستقر أسفل يمكن أن يسبب الذعر النواة أو إعادة التشغيل الفوري)";
"Unlock P-State Editor (DANGEROUS: incorrect settings can crash or damage hardware)" = "فتح محرر P-State (DANGEROUS: الإعدادات غير الصحيحة يمكن أن تتعطل أو تلحق الضرر بالمعدات)";
"Upload" = "تحميل";
"Uptime" = "وقت التحديث";
"Use Popover Menu" = "استخدام قائمة تفتح";
"Used memory in GB" = "الذاكرة المستخدمة في GB";
"Used RAM" = "Used RAM";
"UTC Time" = "توقيت UTC";
"V-F Operating Curve" = "منحنى V-F";
"Value" = "القيمة";
"VDA Decoder" = "تفكيك VDA";
"Visible charts:" = "مخططات مرئية:";
"Volt:" = "Volt:";
"VRAM" = "ساخن";
"VRAM Tracker" = "تعقب VRAM";
"VRAM Used" = "استخدام VRAM";
"VRAM: %.2fG%@" = "VRAM: %.2fG%@";
"W" = "ق";
"Weekday" = "يوم الأسبوع";
"Widget Reordering" = "إعادة ترتيب القطعة";
"Widget Selection & Display Style" = "اختيار ودجت ونمط العرض";
"Widget Style" = "نمط القطعة";
"Write Speed" = "سرعة الكتابة";
"Yes" = "نعم";
"You are running the most recent version of AMD Power Gadget (v%@)." = "أنت تقوم بتشغيل أحدث إصدار من أداة AMD Power Gadget (v%@).";
"You have the latest version installed (v%@)." = "لديك أحدث إصدار مثبت (v%@).";
"°C" = "درجة س";
"Área Rellena (Gradient)" = "أوريا ريلينا (متدرج)";

/* Compatibility / format keys */
"Your AMDRyzenCPUPowerManagement version (%@) is outdated and no longer API compatible. Please use version 3.0.0 or newer and start this application again." = "إصدار AMDRyzenCPUPowerManagement الخاص بك (%@) قديم ولم يعد متوافقًا مع API. الرجاء استخدام الإصدار 3.0.0 أو الأحدث وبدء هذا التطبيق مرة أخرى.";

/* App language picker */
"Language" = "اللغة";
"App Language" = "لغة التطبيق";
"Choose the interface language. The app will restart to apply the change." = "اختر لغة الواجهة. سيتم إعادة تشغيل التطبيق لتطبيق التغيير.";
"System Default" = "النظام الافتراضي";
"Current: %@" = "حاليا: %@";
"Restart required" = "إعادة التشغيل مطلوبة";
"Apply & Restart" = "تطبيق و إعادة التشغيل";
"The app needs to restart to load the selected language." = "يحتاج التطبيق إلى إعادة التشغيل لتحميل اللغة المحددة.";

/* Privilege UX */
"This action requires administrator privileges. Run AMD Power Gadget as root, or add the boot argument -amdpnopchk for debugging." = "يتطلب هذا الإجراء امتيازات المسؤول. قم بتشغيل أداة توليد الطاقة AMD كجذر ، أو قم بإضافة حجة التشغيل -amdpnopchk لتصحيح الأخطاء.";

/* Crowdin: recent UI strings — CPPC badge vs EPP Active Mode */
"CPPC: HW OK" = "CPPC: HW OK";
"CPPC: EPP On" = "CPPC: EPP On";
"This CPU did not report CPPC support to the kext." = "This CPU did not report CPPC support to the kext.";
"If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). The green “CPPC: HW OK” badge only means rankings exist — it is not this switch." = "If the switch snaps back to Off: enable writes with boot-arg -amdpnopchk (or run as root). The green “CPPC: HW OK” badge only means rankings exist — it is not this switch.";
"Native CPPC Active Mode (EPP) is ON. Cores scale autonomously; rankings come from the processor." = "Native CPPC Active Mode (EPP) is ON. Cores scale autonomously; rankings come from the processor.";
"CPPC hardware scores could not be read. Rankings are estimated from observed clocks. This is not the Profiles EPP toggle." = "CPPC hardware scores could not be read. Rankings are estimated from observed clocks. This is not the Profiles EPP toggle.";
"The CPU reports CPPC rankings (HW OK). That does not mean Active Mode is on — enable “Native CPPC Active Mode (EPP)” under Profiles (needs -amdpnopchk or root)." = "The CPU reports CPPC rankings (HW OK). That does not mean Active Mode is on — enable “Native CPPC Active Mode (EPP)” under Profiles (needs -amdpnopchk or root).";
/* Deprecated badge key — kept so old locales still resolve */
"CPPC: Active" = "CPPC: HW OK";
